//
//  Constants.swift
//  myCV
//
//  Created by Konstantin on 13.11.2021.
//

import UIKit

struct Constants {
    static let profileDescription = "Мне 26 лет, в данный момент проживаю в городе Новосибирск. Закончил Новосибирский Государственный Технический Университет по специальности Электроэнергетика. Сразу после университета отработал 3,5 года энергетиком в ГМК 'Норильский Никель'."
    
    static let skillsDescriptionJoke = "C детского сада я увлекся программированием, начав с языка Ассемблер. Далее крепко освоил все остальные языки. В школьные годы вскрыл систему Национального космического агентства США, да-да это был я. Будучи студентом, выиграл чемпионат мира - ICPC. Разработал систему анализа результатов спутниковой телеметрии. Играю в 3D игры в уме при помощи чтения исходного кода. От рекрутеров FAANG отбоя нет, засыпали офферами. Но я всем отказываю, ведь хочу-то я в ЦФТ."
    
    static let skillsDescription = "В школе изучали Pascal. В Университете было несколько проектов на Matlab, Mathcad. С недавних пор активно изучаю Swift. От ЦФТ ожидаю получить систематизированные знания и ближе познакомиться со спецификацией iOS-разработки, получить возможность усовершенствовать навыки программирования и стать частью Вашей команды. Отсутствие опыта коммерческой разработки готов компенсировать жгучим стремлением, желанием обучаться и исключительной дисциплиной."
    
    static let hobbyDescription = "В свободное время люблю почитать. Смотрю различные техноблоги. Занимаюсь футболом. Зимой катаюсь на сноуборде. Последнее время увлекся бегом, недавно пробежал полумарафон."
}
